tutorials/modules/incompressibleVoF/forcedUpstreamWave/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    left
    {
        type            fixedValue;
        value           $internalField;
    }
    right
    {
        type            outletPhaseMeanVelocity;
        UnMean          2;
        alpha           alpha.water;
    }
    top
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity  $internalField;
        value           $internalField;
    }
    bottom
    {
        type            noSlip;
    }
}


// ************************************************************************* //
